In [1]:
import pandas as pd
from sqlalchemy import create_engine
from password import pw

## Cities Table

In [2]:
cities_file = "Resources/cities.csv"
cities_df = pd.read_csv(cities_file)

In [3]:
new_cities_df = cities_df[['id', 'name', 'country']].copy()
new_cities_df = new_cities_df.rename(columns={'id':'city_id', 'name':'city_name'})
new_cities_df.head()

   city_id city_name    country
0        5  Aberdeen   Scotland
1        6  Adelaide  Australia
2        7   Algiers    Algeria
3        9    Ankara     Turkey
4       16     Belém     Brazil

## Tracks Table

In [4]:
tracks_file = "Resources/tracks.csv"
tracks_df = pd.read_csv(tracks_file)

new_tracks_df = tracks_df[['city_id','length']].copy()
track_length = new_tracks_df.groupby('city_id').sum()
track_length.reset_index(inplace=True)
track_length.head()

   city_id   length
0        1  1472481
1        4   475631
2       14   630124
3       15   685994
4       19     1231

## Track Length by City (Merged Table)

In [5]:
track_length_df = new_cities_df.merge(track_length, on='city_id')
track_length_df.sort_values(by='length', inplace=True, ascending=False)
track_length_df.reset_index(inplace=True, drop=True)
track_length_df.head(10)

   city_id     city_name        country   length
0      114         Tokyo          Japan  5011397
1       91         Osaka          Japan  2561000
2       69        London        England  1943677
3        1  Buenos Aires      Argentina  1472481
4      206      New York  United States  1345768
5      107      Shanghai          China   929780
6      106     São Paulo         Brazil   829921
7      139        Boston  United States   724935
8       15       Beijing          China   685994
9       14     Barcelona          Spain   630124

## Stations Table

In [6]:
# stations_file = "Resources/stations.csv"
# stations_df = pd.read_csv(stations_file)

# new_stations_df = stations_df[['city_id', 'id','name']].copy()
# # new_stations_df.sort_values('city_id', inplace=True)
# # new_stations_df.reset_index(inplace=True, drop=True)
# # new_stations_df.head()

# station_count = new_stations_df.groupby('city_id')['name'].nunique()
# station_count = pd.DataFrame(station_count)
# station_count = station_count.rename({'name':'station_count'})
# station_count.reset_index(inplace=True)
# station_count.head()

## Connect to SQL

Before running the script below, please run 'table_create_queries.sql' in pgAdmin first to create the SQL db.

In [7]:
engine = create_engine(f'postgresql://postgres:{pw}@localhost:5432/city_transit_db')

In [8]:
# Confirm tables
engine.table_names()

['cities', 'tracks']

In [11]:
# Load data into SQL db tables
new_cities_df.to_sql(name='cities', con=engine, if_exists='append', index=False)
track_length.to_sql(name='tracks', con=engine, if_exists='append', index=False)

In [12]:
pd.read_sql_query('select * from cities', con=engine).head()

   city_id city_name    country
0        5  Aberdeen   Scotland
1        6  Adelaide  Australia
2        7   Algiers    Algeria
3        9    Ankara     Turkey
4       16     Belém     Brazil

In [13]:
pd.read_sql_query('select * from tracks', con=engine).head()

   city_id   length
0        1  1472481
1        4   475631
2       14   630124
3       15   685994
4       19     1231

In [14]:
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func

In [15]:
# reflect an existing database into a new model
Base = automap_base()
# reflect the tables
Base.prepare(engine, reflect=True)

In [16]:
# We can view all of the classes that automap found
Base.classes.keys()

['cities', 'tracks']

In [17]:
# Save references to each table
Cities = Base.classes.cities
Tracks = Base.classes.tracks

In [18]:
# Create our session (link) from Python to the DB
session = Session(engine)

In [19]:
sel = [Cities.city_id, Cities.city_name, Cities.country, Tracks.length]
city_tracks = session.query(*sel).join(Tracks, Cities.city_id == Tracks.city_id).all()
city_tracks

[(147, 'Chicago', 'United States', 205114),
 (280, 'Clermont-Ferrand', 'France', 30670),
 (268, 'San Sebastián', 'Spain', 71351),
 (29, 'Budapest', 'Hungary', 63525),
 (23, 'Bordeaux', 'France', 129963),
 (19, 'Berlin', 'Germany', 1231),
 (283, 'Besancon', 'France', 28824),
 (45, 'Edinburgh', 'Scotland', 3985),
 (48, 'Glasgow', 'Scotland', 416685),
 (294, 'Le Mans', 'France', 35501),
 (56, 'Hong Kong', 'China', 35108),
 (63, 'Kuala Lumpur', 'Malaysia', 86145),
 (300, 'Montpellier', 'France', 98675),
 (70, 'Lyons', 'France', 134924),
 (67, 'Lisbon', 'Portugal', 116671),
 (72, 'Manchester', 'England', 7247),
 (82, 'Munich', 'Germany', 161279),
 (74, 'Marseilles', 'France', 75902),
 (79, 'Milan', 'Italy', 549126),
 (310, 'Rouen', 'France', 30223),
 (305, 'Dijon', 'France', 38110),
 (317, 'Mulhouse', 'France', 48434),
 (324, 'Nice', 'France', 17665),
 (314, 'Reims', 'France', 11337),
 (318, 'Nancy', 'France', 17481),
 (308, 'Orleans', 'France', 40694),
 (331, 'Le Havre', 'France', 26382),
 (327, 'Lille', 'France', 85485),
 (91, 'Osaka', 'Japan', 2561000),
 (87, 'Naples', 'Italy', 22320),
 (95, 'Paris', 'France', 605402),
 (325, 'Toulouse', 'France', 44707),
 (89, 'Newcastle-on-Tyne', 'England', 152842),
 (328, 'Strasbourg', 'France', 48986),
 (104, 'Salvador', 'Brazil', 27043),
 (99, 'Prague', 'Czech Republic', 93353),
 (307, 'Tours', 'France', 29914),
 (103, 'Rome', 'Italy', 149327),
 (275, 'Angers', 'France', 33944),
 (106, 'São Paulo', 'Brazil', 829921),
 (286, 'Grenoble', 'France', 87433),
 (111, 'Sydney', 'Australia', 357970),
 (77, 'Melbourne', 'Australia', 68080),
 (102, 'Rio de Janeiro', 'Brazil', 161282),
 (64, 'La Paz', 'Bolivia', 33640),
 (114, 'Tokyo', 'Japan', 5011397),
 (293, 'Brest', 'France', 28902),
 (116, 'Venice', 'Italy', 53524),
 (124, 'Valparaíso', 'Chile', 72313),
 (139, 'Boston', 'United States', 724935),
 (34, 'Caracas', 'Venezuela', 9939),
 (152, 'Dallas', 'United States', 125699),
 (148, 'Cincinnati', 'United States', 31236),
 (189, 'Los Angeles', 'United States', 140077),
 (199, 'Montréal', 'Canada', 65491),
 (206, 'New York', 'United States', 1345768),
 (231, 'San Francisco', 'United States', 9497),
 (236, 'Seattle', 'United States', 29066),
 (247, 'Toronto', 'Canada', 506240),
 (255, 'Winnipeg', 'Canada', 203519),
 (256, 'Valencia', 'Spain', 212850),
 (71, 'Madrid', 'Spain', 316471),
 (14, 'Barcelona', 'Spain', 630124),
 (78, 'Mexico City', 'Mexico', 446306),
 (126, 'Guadalajara', 'México', 59450),
 (66, 'Lima', 'Peru', 39004),
 (258, 'Bilbao', 'Spain', 62962),
 (118, 'Vienna', 'Austria', 84970),
 (107, 'Shanghai', 'China', 929780),
 (21, 'Bogotá', 'Colombia', 173514),
 (4, 'Santiago', 'Chile', 475631),
 (1, 'Buenos Aires', 'Argentina', 1472481),
 (261, 'Concepción', 'Chile', 75875),
 (262, 'Genoa', 'Italy', 7081),
 (263, 'Graz', 'Austria', 23670),
 (264, 'Zaragoza', 'Spain', 35208),
 (267, 'Innsbruck', 'Austria', 47447),
 (252, 'Washington', 'United States', 310872),
 (265, 'Nantes', 'France', 248673),
 (110, 'Stockholm', 'Sweden', 140571),
 (266, 'Rennes', 'France', 65153),
 (15, 'Beijing', 'China', 685994),
 (69, 'London', 'England', 1943677)]